; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l29_p29_c29_g29)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 refugio22 refugio23 refugio24 refugio25 refugio26 refugio27 refugio28 refugio29 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 person22 person23 person24 person25 person26 person27 person28 person29 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 comida)
	(at-box box13 deposito)
	(box-has box13 comida)
	(at-box box14 deposito)
	(box-has box14 comida)
	(at-box box15 deposito)
	(box-has box15 comida)
	(at-box box16 deposito)
	(box-has box16 comida)
	(at-box box17 deposito)
	(box-has box17 comida)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-box box22 deposito)
	(box-has box22 medicina)
	(at-box box23 deposito)
	(box-has box23 medicina)
	(at-box box24 deposito)
	(box-has box24 medicina)
	(at-box box25 deposito)
	(box-has box25 medicina)
	(at-box box26 deposito)
	(box-has box26 medicina)
	(at-box box27 deposito)
	(box-has box27 medicina)
	(at-box box28 deposito)
	(box-has box28 medicina)
	(at-box box29 deposito)
	(box-has box29 medicina)
	(at-person person1 refugio14)
	(at-person person2 refugio24)
	(at-person person3 refugio26)
	(at-person person4 refugio5)
	(at-person person5 refugio23)
	(at-person person6 refugio16)
	(at-person person7 refugio27)
	(at-person person8 refugio26)
	(at-person person9 refugio12)
	(at-person person10 refugio21)
	(at-person person11 refugio29)
	(at-person person12 refugio5)
	(at-person person13 refugio22)
	(at-person person14 refugio1)
	(at-person person15 refugio23)
	(at-person person16 refugio23)
	(at-person person17 refugio21)
	(at-person person18 refugio10)
	(at-person person19 refugio21)
	(at-person person20 refugio21)
	(at-person person21 refugio9)
	(at-person person22 refugio8)
	(at-person person23 refugio12)
	(at-person person24 refugio15)
	(at-person person25 refugio16)
	(at-person person26 refugio4)
	(at-person person27 refugio3)
	(at-person person28 refugio14)
	(at-person person29 refugio28)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person3 comida)
	(person-has person3 medicina)
	(person-has person4 medicina)
	(person-has person5 comida)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person8 comida)
	(person-has person11 comida)
	(person-has person12 comida)
	(person-has person12 medicina)
	(person-has person13 medicina)
	(person-has person15 comida)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person19 medicina)
	(person-has person20 comida)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person23 comida)
	(person-has person23 medicina)
	(person-has person24 comida)
	(person-has person28 comida)
	(person-has person28 medicina)
	(person-has person29 comida)
))
)

; plan
1. (pick box29 deposito dron1-der dron1)
   deleted: (at-box box29 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box29)
   goals met: 0 of 29
2. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 0 of 29
3. (move deposito refugio24 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio24)
   goals met: 0 of 29
4. (leave box17 refugio24 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 comida)
   added: (at-box box17 refugio24) (free dron1-izq) (person-has person2 comida)
   goals met: 1 of 29
5. (move refugio24 deposito dron1)
   deleted: (at-dron dron1 refugio24)
   added: (at-dron dron1 deposito)
   goals met: 1 of 29
6. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 1 of 29
7. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 1 of 29
8. (move refugio16 refugio27 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio27)
   goals met: 1 of 29
9. (leave box16 refugio27 dron1-izq dron1 person7 comida)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 comida)
   added: (at-box box16 refugio27) (free dron1-izq) (person-has person7 comida)
   goals met: 2 of 29
10. (move refugio27 deposito dron1)
   deleted: (at-dron dron1 refugio27)
   added: (at-dron dron1 deposito)
   goals met: 2 of 29
11. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 2 of 29
12. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 2 of 29
13. (move refugio16 refugio29 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio29)
   goals met: 2 of 29
14. (leave box15 refugio29 dron1-izq dron1 person11 comida)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 comida)
   added: (at-box box15 refugio29) (free dron1-izq) (person-has person11 comida)
   goals met: 3 of 29
15. (move refugio29 deposito dron1)
   deleted: (at-dron dron1 refugio29)
   added: (at-dron dron1 deposito)
   goals met: 3 of 29
16. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 3 of 29
17. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 3 of 29
18. (move refugio16 refugio22 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio22)
   goals met: 3 of 29
19. (leave box29 refugio22 dron1-der dron1 person13 medicina)
   deleted: (carrying dron1 dron1-der box29) (box-has box29 medicina)
   added: (at-box box29 refugio22) (free dron1-der) (person-has person13 medicina)
   goals met: 4 of 29
20. (move refugio22 deposito dron1)
   deleted: (at-dron dron1 refugio22)
   added: (at-dron dron1 deposito)
   goals met: 4 of 29
21. (pick box28 deposito dron1-der dron1)
   deleted: (at-box box28 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box28)
   goals met: 4 of 29
22. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 4 of 29
23. (move refugio16 refugio9 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio9)
   goals met: 4 of 29
24. (leave box14 refugio9 dron1-izq dron1 person21 comida)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 comida)
   added: (at-box box14 refugio9) (free dron1-izq) (person-has person21 comida)
   goals met: 5 of 29
25. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 5 of 29
26. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 5 of 29
27. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 5 of 29
28. (move refugio16 refugio15 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio15)
   goals met: 5 of 29
29. (leave box13 refugio15 dron1-izq dron1 person24 comida)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 comida)
   added: (at-box box13 refugio15) (free dron1-izq) (person-has person24 comida)
   goals met: 6 of 29
30. (move refugio15 deposito dron1)
   deleted: (at-dron dron1 refugio15)
   added: (at-dron dron1 deposito)
   goals met: 6 of 29
31. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 6 of 29
32. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 6 of 29
33. (move refugio16 refugio28 dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 refugio28)
   goals met: 6 of 29
34. (leave box12 refugio28 dron1-izq dron1 person29 comida)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 comida)
   added: (at-box box12 refugio28) (free dron1-izq) (person-has person29 comida)
   goals met: 7 of 29
35. (move refugio28 deposito dron1)
   deleted: (at-dron dron1 refugio28)
   added: (at-dron dron1 deposito)
   goals met: 7 of 29
36. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 7 of 29
37. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 7 of 29
38. (leave box11 refugio16 dron1-izq dron1 person6 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio16) (free dron1-izq) (person-has person6 comida)
   goals met: 8 of 29
39. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 8 of 29
40. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 8 of 29
41. (move deposito refugio16 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio16)
   goals met: 8 of 29
42. (leave box28 refugio16 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box28) (box-has box28 medicina)
   added: (at-box box28 refugio16) (free dron1-der) (person-has person6 medicina)
   goals met: 9 of 29
43. (move refugio16 deposito dron1)
   deleted: (at-dron dron1 refugio16)
   added: (at-dron dron1 deposito)
   goals met: 9 of 29
44. (pick box27 deposito dron1-der dron1)
   deleted: (at-box box27 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box27)
   goals met: 9 of 29
45. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 9 of 29
46. (leave box10 refugio26 dron1-izq dron1 person3 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio26) (free dron1-izq) (person-has person3 comida)
   goals met: 10 of 29
47. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 10 of 29
48. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 10 of 29
49. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 10 of 29
50. (leave box27 refugio26 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box27) (box-has box27 medicina)
   added: (at-box box27 refugio26) (free dron1-der) (person-has person3 medicina)
   goals met: 11 of 29
51. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 11 of 29
52. (pick box26 deposito dron1-der dron1)
   deleted: (at-box box26 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box26)
   goals met: 11 of 29
53. (move deposito refugio26 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio26)
   goals met: 11 of 29
54. (leave box9 refugio26 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio26) (free dron1-izq) (person-has person8 comida)
   goals met: 12 of 29
55. (move refugio26 deposito dron1)
   deleted: (at-dron dron1 refugio26)
   added: (at-dron dron1 deposito)
   goals met: 12 of 29
56. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 12 of 29
57. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 12 of 29
58. (leave box26 refugio5 dron1-der dron1 person4 medicina)
   deleted: (carrying dron1 dron1-der box26) (box-has box26 medicina)
   added: (at-box box26 refugio5) (free dron1-der) (person-has person4 medicina)
   goals met: 13 of 29
59. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 13 of 29
60. (pick box25 deposito dron1-der dron1)
   deleted: (at-box box25 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box25)
   goals met: 13 of 29
61. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 13 of 29
62. (leave box8 refugio5 dron1-izq dron1 person12 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio5) (free dron1-izq) (person-has person12 comida)
   goals met: 14 of 29
63. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 14 of 29
64. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 14 of 29
65. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 14 of 29
66. (leave box25 refugio5 dron1-der dron1 person12 medicina)
   deleted: (carrying dron1 dron1-der box25) (box-has box25 medicina)
   added: (at-box box25 refugio5) (free dron1-der) (person-has person12 medicina)
   goals met: 15 of 29
67. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 15 of 29
68. (pick box24 deposito dron1-der dron1)
   deleted: (at-box box24 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box24)
   goals met: 15 of 29
69. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 15 of 29
70. (leave box7 refugio23 dron1-izq dron1 person5 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio23) (free dron1-izq) (person-has person5 comida)
   goals met: 16 of 29
71. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 16 of 29
72. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 16 of 29
73. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 16 of 29
74. (leave box24 refugio23 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box24) (box-has box24 medicina)
   added: (at-box box24 refugio23) (free dron1-der) (person-has person5 medicina)
   goals met: 17 of 29
75. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 17 of 29
76. (pick box23 deposito dron1-der dron1)
   deleted: (at-box box23 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box23)
   goals met: 17 of 29
77. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 17 of 29
78. (leave box6 refugio23 dron1-izq dron1 person15 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio23) (free dron1-izq) (person-has person15 comida)
   goals met: 18 of 29
79. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 18 of 29
80. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 18 of 29
81. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 18 of 29
82. (leave box5 refugio23 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio23) (free dron1-izq) (person-has person16 comida)
   goals met: 19 of 29
83. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 19 of 29
84. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 19 of 29
85. (move deposito refugio23 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio23)
   goals met: 19 of 29
86. (leave box23 refugio23 dron1-der dron1 person16 medicina)
   deleted: (carrying dron1 dron1-der box23) (box-has box23 medicina)
   added: (at-box box23 refugio23) (free dron1-der) (person-has person16 medicina)
   goals met: 20 of 29
87. (move refugio23 deposito dron1)
   deleted: (at-dron dron1 refugio23)
   added: (at-dron dron1 deposito)
   goals met: 20 of 29
88. (pick box22 deposito dron1-der dron1)
   deleted: (at-box box22 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box22)
   goals met: 20 of 29
89. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 20 of 29
90. (leave box22 refugio21 dron1-der dron1 person19 medicina)
   deleted: (carrying dron1 dron1-der box22) (box-has box22 medicina)
   added: (at-box box22 refugio21) (free dron1-der) (person-has person19 medicina)
   goals met: 21 of 29
91. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 21 of 29
92. (pick box21 deposito dron1-der dron1)
   deleted: (at-box box21 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box21)
   goals met: 21 of 29
93. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 21 of 29
94. (leave box4 refugio21 dron1-izq dron1 person20 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio21) (free dron1-izq) (person-has person20 comida)
   goals met: 22 of 29
95. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 22 of 29
96. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 22 of 29
97. (move deposito refugio21 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio21)
   goals met: 22 of 29
98. (leave box21 refugio21 dron1-der dron1 person20 medicina)
   deleted: (carrying dron1 dron1-der box21) (box-has box21 medicina)
   added: (at-box box21 refugio21) (free dron1-der) (person-has person20 medicina)
   goals met: 23 of 29
99. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 23 of 29
100. (pick box20 deposito dron1-der dron1)
   deleted: (at-box box20 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box20)
   goals met: 23 of 29
101. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 23 of 29
102. (leave box3 refugio12 dron1-izq dron1 person23 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio12) (free dron1-izq) (person-has person23 comida)
   goals met: 24 of 29
103. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 24 of 29
104. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 24 of 29
105. (move deposito refugio12 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio12)
   goals met: 24 of 29
106. (leave box20 refugio12 dron1-der dron1 person23 medicina)
   deleted: (carrying dron1 dron1-der box20) (box-has box20 medicina)
   added: (at-box box20 refugio12) (free dron1-der) (person-has person23 medicina)
   goals met: 25 of 29
107. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 25 of 29
108. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 25 of 29
109. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 25 of 29
110. (leave box2 refugio14 dron1-izq dron1 person1 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio14) (free dron1-izq) (person-has person1 comida)
   goals met: 26 of 29
111. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 26 of 29
112. (pick box1 deposito dron1-izq dron1)
   deleted: (at-box box1 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box1)
   goals met: 26 of 29
113. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 26 of 29
114. (leave box1 refugio14 dron1-izq dron1 person28 comida)
   deleted: (carrying dron1 dron1-izq box1) (box-has box1 comida)
   added: (at-box box1 refugio14) (free dron1-izq) (person-has person28 comida)
   goals met: 27 of 29
115. (leave box19 refugio14 dron1-der dron1 person1 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio14) (free dron1-der) (person-has person1 medicina)
   goals met: 28 of 29
116. (move refugio14 deposito dron1)
   deleted: (at-dron dron1 refugio14)
   added: (at-dron dron1 deposito)
   goals met: 28 of 29
117. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 28 of 29
118. (move deposito refugio14 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio14)
   goals met: 28 of 29
119. (leave box18 refugio14 dron1-der dron1 person28 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio14) (free dron1-der) (person-has person28 medicina)
   goals met: 29 of 29
